{
  "profile": {
    "name": "Zahra Fattahi",
    "title": "Frontend Developer",
    "bio": "Hello, here's who I am & what I do",
    "description": "I am a dedicated Frontend Developer with extensive experience in creating dynamic, user-friendly web applications using modern technologies. Proficient in React, Vue, and Nuxt, I build responsive and intuitive interfaces with a strong command of JavaScript, HTML, and CSS. My expertise in Tailwind CSS and Bootstrap enables me to design visually appealing layouts. Committed to continuous learning and collaboration, I excel in team environments, working closely with designers and developers to deliver high-quality, innovative solutions.",
    "image": "/me.jpg",
    "socialLinks": {
      "facebook": "#",
      "twitter": "#",
      "linkedin": "https://www.linkedin.com/in/zahra-fattahi-9b3911201/",
      "github": "https://github.com/zahra77fth"
    }
  },
  "education": [
    {
      "startYear": 2017,
      "endYear": 2021,
      "universityName": "Alzahra University",
      "degreeLevel": "B.S. in Computer Sciences",
      "location": "Tehran, Iran",
      "description": "Alzahra University ranked 17 in Iran and 801 worldwide according to the physical sciences subject ranking. Graduated with a GPA of 7.5."
    },
    {
      "startYear": 2021,
      "endYear": 2024,
      "universityName": "Kharazmi University",
      "degreeLevel": "M.S. in Computer Sciences",
      "location": "Tehran, Iran",
      "description": "Currently pursuing a Master's degree with a thesis titled 'Using Data Mining for Network Intrusion Detection'. Expected to graduate by the end of August 2024."
    }
  ],
  "experiences": [
    {
      "companyName": "Nobitex",
      "startYear": 2022,
      "endYear": 2024,
      "employmentType": "Fulltime",
      "position": "Frontend Developer",
      "companyWebsite": "https://nobitex.ir",
      "details": [
        {
          "title": "Interdepartmental Collaboration",
          "description": "Facilitated effective communication and collaboration between SEO and frontend teams, ensuring seamless alignment of goals and expectations and cut down paperwork by 75%."
        },
        {
          "title": "Design Pattern Implementation",
          "description": "Implemented industry-recognized design patterns to optimize code structure, enhancing maintainability, scalability, and reusability by 35%; reduced bug-fixing time by 40% and increased development efficiency by 30%."
        },
        {
          "title": "Crypto Industry Proficiency",
          "description": "Delved into the cryptocurrency domain to deepen understanding and support the company's related projects, enhancing the ability to contribute meaningfully to crypto-focused initiatives."
        },
        {
          "title": "Performance Enhancement",
          "description": "Successfully integrated plugins into the website, significantly improving code efficiency and streamlining process times, resulting in a 25% reduction in page load times and increased user engagement."
        },
        {
          "title": "Content Management",
          "description": "Took charge of adding new content and creating landing pages for newly introduced coins on the website, contributing to the platform's up-to-date and engaging offerings, resulting in a 40% increase in user interactions with the new content."
        },
        {
          "title": "Responsive Design Implementation",
          "description": "Executed responsive design principles within the Nuxt project, delivering a consistent user experience across various devices and screen sizes."
        }
      ]
    },
    {
      "companyName": "Axon",
      "startYear": 2020,
      "endYear": 2022,
      "employmentType": "Fulltime",
      "position": "Frontend Developer",
      "details": [
        {
          "title": "Community Building",
          "description": "Spearheaded the creation of a vibrant community of over 30 frontend developers through meetups and virtual forums. This platform fostered collaboration, facilitated knowledge sharing, and cultivated a strong sense of teamwork."
        },
        {
          "title": "Framework Mastery",
          "description": "Mastered multiple frontend frameworks including Tailwind CSS, Bootstrap, and Vuetify, showcasing adaptability and enabling the creation of visually appealing and responsive user interfaces for diverse projects."
        },
        {
          "title": "Continuous Improvement Advocate",
          "description": "Advocated for and facilitated the adoption of best practices, resulting in a substantial 60% improvement in code quality and operational efficiency across the team's projects, leading to a 15% reduction in bug reports from quality assurance."
        }
      ]
    },
    {
      "companyName": "Over Clock",
      "startYear": 2020,
      "endYear": 2020,
      "employmentType": "Part-time",
      "position": "Frontend Developer Intern",
      "details": [
        {
          "title": "Methodological Consistency",
          "description": "Implemented BEM methodology for CSS in a recent project, resulting in a modular and organized structure. This streamlined collaboration, reduced development time by 20%, and lowered CSS-related bugs. The approach facilitated targeted updates, enhancing both code quality and delivery efficiency."
        }
      ]
    },
    {
      "companyName": "Alzahra University",
      "startYear": 2019,
      "endYear": 2020,
      "employmentType": "Part-time",
      "position": "Teacher Assistant",
      "details": [
        {
          "title": "Teaching and Examination Assistance",
          "description": "Assisted in teaching and evaluating advanced computer programming in Java and Python, providing guidance to students on complex coding concepts and projects."
        },
        {
          "title": "Advanced Algorithm Class Assistant",
          "description": "Served as a teacher's assistant for an Advanced Algorithm class for two semesters, offering support to students in understanding and implementing intricate algorithmic techniques."
        },
        {
          "title": "Machine Learning Class Assistant",
          "description": "Worked as a teacher's assistant for a Machine Learning class, helping students grasp the principles and applications of machine learning in real-world scenarios."
        }
      ]
    }
  ],
  "skills": [
    {
      "title": "Dedicated",
      "description": "Committed to achieving project excellence, consistently delivering results on time."
    },
    {
      "title": "Adaptive",
      "description": "Successfully integrated new technologies into 4+ projects, enhancing project efficiency by 20%."
    },
    {
      "title": "Effective Communication",
      "description": "Facilitated cross-departmental cooperation, ensuring seamless collaboration among 3+ teams."
    },
    {
      "title": "Self-Development",
      "description": "Engaged in continuous learning, completing 10+ online courses to enhance skill set."
    },
    {
      "title": "Innovative",
      "description": "Introduced creative solutions that reduced error rates by 15% and saved 32 hours monthly."
    },
    {
      "title": "Cultural Sensitivity and Flexible",
      "description": "Adapted to diverse cultural environments and maintained flexibility in various scenarios."
    },
    {
      "title": "Scrum",
      "description": "Experienced in Scrum methodologies, effectively managing sprint planning and execution."
    },
    {
      "title": "Agile",
      "description": "Worked with cross-functional teams to adapt Agile principles, leading to improved project outcomes."
    }
  ]
}